R2fA9r/STM32/STM32F412G_Disco_CDC_RNDIS_lwIP/Middlewares/ST/STM32_USB_Device_Library/Class/CDC_RNDIS/Src/usbd_cdc_rndis.c
/**
  ******************************************************************************
  * @file    usbd_cdc_rndis.c
  * @author  MCD Application Team,
  * 		 Rolf S. Adelsberger
  * @brief   This file provides the high layer firmware functions to manage the
  *          following functionalities of the USB CDC_RNDIS Class:
  *           - Initialization and Configuration of high and low layer
  *           - Enumeration as CDC_RNDIS Device (and enumeration for each implemented memory interface)
  *           - OUT/IN data transfer
  *           - Command IN transfer (class requests management)
  *           - Error management
  *
  *  @verbatim
  *
  *          ===================================================================
  *                                CDC_RNDIS Class Driver Description
  *          ===================================================================
  *           This driver manages the "Universal Serial Bus Class Definitions for Communications Devices
  *           Revision 1.2 November 16, 2007" and the sub-protocol specification of "Universal Serial Bus
  *           Communications Class Subclass Specification for PSTN Devices Revision 1.2 February 9, 2007"
  *           This driver implements the following aspects of the specification:
  *             - Device descriptor management
  *             - Configuration descriptor management
  *             - Enumeration as CDC device with 2 data endpoints (IN and OUT) and 1 command endpoint (IN)
  *             - Requests management (as described in section 6.2 in specification)
  *             - Abstract Control Model compliant
  *             - Union Functional collection (using 1 IN endpoint for control)
  *             - Data interface class
  *
  *           These aspects may be enriched or modified for a specific user application.
  *
  *            This driver doesn't implement the following aspects of the specification
  *            (but it is possible to manage these features with some modifications on this driver):
  *             - Any class-specific aspect relative to communication classes should be managed by user application.
  *             - All communication classes other than PSTN are not managed
  *
  *  @endverbatim
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                      www.st.com/SLA0044
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "usbd_cdc_rndis.h"
#include "usbd_ctlreq.h"
#include <stm32412g_discovery.h>

#ifndef __USBD_CDC_RNDIS_IF_H
#include <usbd_cdc_rndis_if.h>
#endif

#include <usb_descriptor_types.h>
/** @addtogroup STM32_USB_DEVICE_LIBRARY
  * @{
  */


/** @defgroup USBD_CDC_RNDIS
  * @brief usbd core module
  * @{
  */

/** @defgroup USBD_CDC_RNDIS_Private_TypesDefinitions
  * @{
  */
/**
  * @}
  */


/** @defgroup USBD_CDC_RNDIS_Private_Defines
  * @{
  */
/**
  * @}
  */


/** @defgroup USBD_CDC_RNDIS_Private_Macros
  * @{
  */

/**
  * @}
  */


/** @defgroup USBD_CDC_RNDIS_Private_FunctionPrototypes
  * @{
  */

static uint8_t USBD_CDC_RNDIS_Init(USBD_HandleTypeDef *pdev, uint8_t cfgidx);
static uint8_t USBD_CDC_RNDIS_DeInit(USBD_HandleTypeDef *pdev, uint8_t cfgidx);

static uint8_t USBD_CDC_RNDIS_Setup(USBD_HandleTypeDef *pdev,
                                    USBD_SetupReqTypedef *req);

static uint8_t USBD_CDC_RNDIS_DataIn(USBD_HandleTypeDef *pdev, uint8_t epnum);
static uint8_t USBD_CDC_RNDIS_DataOut(USBD_HandleTypeDef *pdev, uint8_t epnum);
static uint8_t USBD_CDC_RNDIS_EP0_RxReady(USBD_HandleTypeDef *pdev);
static uint8_t *USBD_CDC_RNDIS_GetFSCfgDesc(uint16_t *length);
static uint8_t *USBD_CDC_RNDIS_GetHSCfgDesc(uint16_t *length);
static uint8_t *USBD_CDC_RNDIS_GetOtherSpeedCfgDesc(uint16_t *length);
static uint8_t *USBD_CDC_RNDIS_GetOtherSpeedCfgDesc(uint16_t *length);

#if (USBD_SUPPORT_USER_STRING_DESC == 1U)
static uint8_t *USBD_CDC_RNDIS_USRStringDescriptor(USBD_HandleTypeDef *pdev, uint8_t index, uint16_t *length);
#endif

uint8_t *USBD_CDC_RNDIS_GetDeviceQualifierDescriptor(uint16_t *length);


/* CDC_RNDIS Internal messages parsing and construction functions */
static uint8_t USBD_CDC_RNDIS_MsgParsing(USBD_HandleTypeDef *pdev, uint8_t *RxBuff);
static uint8_t USBD_CDC_RNDIS_ProcessInitMsg(USBD_HandleTypeDef *pdev, USBD_CDC_RNDIS_InitMsgTypeDef *Msg);
static uint8_t USBD_CDC_RNDIS_ProcessHaltMsg(USBD_HandleTypeDef *pdev, USBD_CDC_RNDIS_HaltMsgTypeDef *Msg);
static uint8_t USBD_CDC_RNDIS_ProcessKeepAliveMsg(USBD_HandleTypeDef *pdev, USBD_CDC_RNDIS_KpAliveMsgTypeDef *Msg);
static uint8_t USBD_CDC_RNDIS_ProcessQueryMsg(USBD_HandleTypeDef *pdev, USBD_CDC_RNDIS_QueryMsgTypeDef *Msg);
static uint8_t USBD_CDC_RNDIS_ProcessSetMsg(USBD_HandleTypeDef *pdev, USBD_CDC_RNDIS_SetMsgTypeDef *Msg);
static uint8_t USBD_CDC_RNDIS_ProcessResetMsg(USBD_HandleTypeDef *pdev, USBD_CDC_RNDIS_ResetMsgTypeDef *Msg);
static uint8_t USBD_CDC_RNDIS_ProcessPacketMsg(USBD_HandleTypeDef *pdev, USBD_CDC_RNDIS_PacketMsgTypeDef *Msg);
static uint8_t USBD_CDC_RNDIS_ProcessUnsupportedMsg(USBD_HandleTypeDef *pdev, USBD_CDC_RNDIS_CtrlMsgTypeDef *Msg);

USBDeviceQualifierDescriptor_t USBD_CDC_RNDIS_DeviceQualifierDesc = {
		sizeof(USBDeviceQualifierDescriptor_t),
		USB_DESC_TYPE_DEVICE_QUALIFIER,
		0x0200,
		0x00,
		0x00,
		0x00,
		USB_MAX_EP0_SIZE,
		USBD_MAX_NUM_CONFIGURATION,
		0x00
};


static uint8_t MAC_StrDesc[6] = {
		CDC_RNDIS_MAC_ADDR0,
		CDC_RNDIS_MAC_ADDR1,
		CDC_RNDIS_MAC_ADDR2,
		CDC_RNDIS_MAC_ADDR3,
		CDC_RNDIS_MAC_ADDR4,
		CDC_RNDIS_MAC_ADDR5
};

static uint32_t ConnSpeedTab[2] = {
		CDC_RNDIS_CONNECT_SPEED_UPSTREAM,
		CDC_RNDIS_CONNECT_SPEED_DOWNSTREAM
};

static uint8_t EmptyResponse = 0x00U;

/**
  * @}
  */

/** @defgroup USBD_CDC_RNDIS_Private_Variables
  * @{
  */


/* CDC_RNDIS interface class callbacks structure */
USBD_ClassTypeDef USBD_CDC_RNDIS =
{
  USBD_CDC_RNDIS_Init,
  USBD_CDC_RNDIS_DeInit,
  USBD_CDC_RNDIS_Setup,
  NULL,                 /* EP0_TxSent, */
  USBD_CDC_RNDIS_EP0_RxReady,
  USBD_CDC_RNDIS_DataIn,
  USBD_CDC_RNDIS_DataOut,
  NULL,
  NULL,
  NULL,
  USBD_CDC_RNDIS_GetHSCfgDesc,
  USBD_CDC_RNDIS_GetFSCfgDesc,
  USBD_CDC_RNDIS_GetOtherSpeedCfgDesc,
  USBD_CDC_RNDIS_GetDeviceQualifierDescriptor,
#if (USBD_SUPPORT_USER_STRING_DESC == 1U)
  USBD_CDC_RNDIS_USRStringDescriptor,
#endif
};


USBDeviceConfigurationDescriptor_t USBD_CDC_RNDIS_CfgFSDesc = {
		// regular configuration descriptor
		{
				sizeof(USBConfigurationDescriptor_t),
				USB_DESC_TYPE_CONFIGURATION,
				sizeof(USBDeviceConfigurationDescriptor_t),
				0x02,
				0x01,
				0x00,
				0xc0,
				0x32,
		},
		// communication class itf
		{
				sizeof(USBInterfaceDescriptor_t),
				USB_DESC_TYPE_INTERFACE,
				CDC_RNDIS_CMD_ITF_NBR,
				0x00,
				0x01,
#if 0
//Linux or windows 7
				CDC_INTERFACE_CLASS_COMMUNICATION,        //bInterfaceClass
				CDC_INTERFACE_SUBCLASS_ACM,               //bInterfaceSubClass
				CDC_INTERFACE_PROTOCOL_VENDOR_SPECIFIC,   //bInterfaceProtocol
#else
				//Windows 10
				CDC_INTERFACE_CLASS_RNDIS,                //bInterfaceClass
				CDC_INTERFACE_SUBCLASS_RNDIS,             //bInterfaceSubClass
				CDC_INTERFACE_PROTOCOL_RNDIS,             //bInterfaceProtocol
#endif
				0
		},
		// CDC header functional descriptor
		{
				sizeof(USBCDCHeaderDescriptor_t),
				CDC_CS_INTERFACE,                         //bDescriptorType
				CDC_HEADER_DESC_SUBTYPE,                  //bDescriptorSubtype
				0x0110,

		},
		// CDC call mgmt functional descriptor
		{
				sizeof(USBCDCCallManagementDescriptor_t),
				CDC_CS_INTERFACE,                         //bDescriptorType
				CDC_CALL_MANAGEMENT_DESC_SUBTYPE,         //bDescriptorSubtype
				0x00,                                     //bmCapabilities
				CDC_RNDIS_COM_ITF_NBR                                         //bDataInterface
		},
		// CDC abstract control mgmt func descr
		{
				sizeof(USBCDCACMDescriptor_t),
				CDC_CS_INTERFACE,                         //bDescriptorType
				CDC_ACM_DESC_SUBTYPE,                     //bDescriptorSubtype
				0x00                                      //bmCapabilities
		},
		// CDC union funct descr
		{
				sizeof(USBCDCUnionDescriptor_t),
				CDC_CS_INTERFACE,                         //bDescriptorType
				CDC_UNION_DESC_SUBTYPE,                   //bDescriptorSubtype
				CDC_RNDIS_CMD_ITF_NBR,
				CDC_RNDIS_COM_ITF_NBR,
		},
		// descriptor for notification endpoint
		{
				sizeof(USBEndpointDescriptor),
				USB_DESC_TYPE_ENDPOINT,
				CDC_RNDIS_CMD_EP,
				USB_ENDPOINT_TYPE_INTERRUPT,
				CDC_RNDIS_CMD_PACKET_SIZE,
				1
		},
		// data class interface descriptor
		{
				sizeof(USBInterfaceDescriptor_t),
				USB_DESC_TYPE_INTERFACE,
				CDC_RNDIS_COM_ITF_NBR,
				0x00,
				0x02,
				CDC_INTERFACE_CLASS_DATA,
				CDC_INTERFACE_SUBCLASS_DATA,
				CDC_INTERFACE_PROTOCOL_DATA,
				0x00,
		},
		// data IN endpoint desc
		{
				sizeof(USBEndpointDescriptor),
				USB_DESC_TYPE_ENDPOINT,
				CDC_RNDIS_IN_EP,
				USB_ENDPOINT_TYPE_BULK,
				CDC_RNDIS_DATA_FS_MAX_PACKET_SIZE,
				0
		},
		// data OUT endpint
		{
				sizeof(USBEndpointDescriptor),
				USB_DESC_TYPE_ENDPOINT,
				CDC_RNDIS_OUT_EP,
				USB_ENDPOINT_TYPE_BULK,
				CDC_RNDIS_DATA_FS_MAX_PACKET_SIZE,
				0
		}
};




static const uint32_t CDC_RNDIS_SupportedOIDs[] =
{
  OID_GEN_SUPPORTED_LIST,
  OID_GEN_HARDWARE_STATUS,
  OID_GEN_MEDIA_SUPPORTED,
  OID_GEN_MEDIA_IN_USE,
  OID_GEN_MAXIMUM_FRAME_SIZE,
  OID_GEN_LINK_SPEED,
  OID_GEN_TRANSMIT_BLOCK_SIZE,
  OID_GEN_RECEIVE_BLOCK_SIZE,
  OID_GEN_VENDOR_ID,
  OID_GEN_VENDOR_DESCRIPTION,
  OID_GEN_CURRENT_PACKET_FILTER,
  OID_GEN_MAXIMUM_TOTAL_SIZE,
  OID_GEN_MEDIA_CONNECT_STATUS,
  OID_GEN_MAXIMUM_SEND_PACKETS,
  OID_802_3_PERMANENT_ADDRESS,
  OID_802_3_CURRENT_ADDRESS,
  OID_802_3_MULTICAST_LIST,
  OID_802_3_MAXIMUM_LIST_SIZE,
  OID_802_3_RCV_ERROR_ALIGNMENT,
  OID_802_3_XMIT_ONE_COLLISION,
  OID_802_3_XMIT_MORE_COLLISIONS,
};

/**
  * @}
  */

/** @defgroup USBD_CDC_RNDIS_Private_Functions
  * @{
  */

/**
  * @brief  USBD_CDC_RNDIS_Init
  *         Initialize the CDC CDC_RNDIS interface
  * @param  pdev: device instance
  * @param  cfgidx: Configuration index
  * @retval status
  */

