R2fA9r/STM32/STM32F412G_Disco_CDC_RNDIS_lwIP/Middlewares/ST/STM32_USB_Device_Library/Class/CDC_RNDIS/Src/usbd_cdc_rndis.c
//USBD_CDC_RNDIS_HandleTypeDef m_hcdc;

static uint8_t USBD_CDC_RNDIS_Init(USBD_HandleTypeDef *pdev, uint8_t cfgidx) {
	UNUSED(cfgidx);
	USBD_CDC_RNDIS_HandleTypeDef *hcdc;

	hcdc = (USBD_CDC_RNDIS_HandleTypeDef*)USBD_malloc(sizeof(USBD_CDC_RNDIS_HandleTypeDef));

	if (hcdc == NULL) {
		pdev->pClassData = NULL;
		return (uint8_t) USBD_FAIL;
	}

	pdev->pClassData = hcdc;

	if (pdev->dev_speed == USBD_SPEED_HIGH) {
		/* Open EP IN */
		(void) USBD_LL_OpenEP(pdev, CDC_RNDIS_IN_EP, USBD_EP_TYPE_BULK, CDC_RNDIS_DATA_HS_IN_PACKET_SIZE);

		pdev->ep_in[CDC_RNDIS_IN_EP & 0xFU].is_used = 1U;

		/* Open EP OUT */
		(void) USBD_LL_OpenEP(pdev, CDC_RNDIS_OUT_EP, USBD_EP_TYPE_BULK, CDC_RNDIS_DATA_HS_OUT_PACKET_SIZE);

		pdev->ep_out[CDC_RNDIS_OUT_EP & 0xFU].is_used = 1U;


	} else {
		/* Open EP IN */
		(void) USBD_LL_OpenEP(pdev, CDC_RNDIS_IN_EP, USBD_EP_TYPE_BULK,CDC_RNDIS_DATA_FS_IN_PACKET_SIZE);

		pdev->ep_in[CDC_RNDIS_IN_EP & 0xFU].is_used = 1U;

		/* Open EP OUT */
		(void) USBD_LL_OpenEP(pdev, CDC_RNDIS_OUT_EP, USBD_EP_TYPE_BULK,CDC_RNDIS_DATA_FS_OUT_PACKET_SIZE);

		pdev->ep_out[CDC_RNDIS_OUT_EP & 0xFU].is_used = 1U;

	}

	/* Open Command IN EP */
	(void) USBD_LL_OpenEP(pdev, CDC_RNDIS_CMD_EP, USBD_EP_TYPE_INTR, CDC_RNDIS_CMD_PACKET_SIZE);
	pdev->ep_in[CDC_RNDIS_CMD_EP & 0xFU].is_used = 1U;

	/* Init  physical Interface components */
	((USBD_CDC_RNDIS_ItfTypeDef *) pdev->pUserData)->Init();

	/* Init the CDC_RNDIS state */
	hcdc->State = CDC_RNDIS_STATE_BUS_INITIALIZED;

	/* Init Xfer states */
	hcdc->TxState = 0U;
	hcdc->RxState = 0U;
	hcdc->RxLength = 0U;
	hcdc->TxLength = 0U;
	hcdc->LinkStatus = 0U;
	hcdc->NotificationStatus = 0U;
	hcdc->MaxPcktLen = (pdev->dev_speed == USBD_SPEED_HIGH) ? CDC_RNDIS_DATA_HS_MAX_PACKET_SIZE : CDC_RNDIS_DATA_FS_MAX_PACKET_SIZE;

	/* Prepare Out endpoint to receive next packet */
	(void) USBD_LL_PrepareReceive(pdev, CDC_RNDIS_OUT_EP, hcdc->RxBuffer, hcdc->MaxPcktLen);

	return (uint8_t) USBD_OK;
}

/**
  * @brief  USBD_CDC_RNDIS_DeInit
  *         DeInitialize the CDC layer
  * @param  pdev: device instance
  * @param  cfgidx: Configuration index
  * @retval status
  */
static uint8_t USBD_CDC_RNDIS_DeInit(USBD_HandleTypeDef *pdev, uint8_t cfgidx)
{
  UNUSED(cfgidx);

  /* Close EP IN */
  (void)USBD_LL_CloseEP(pdev, CDC_RNDIS_IN_EP);
  pdev->ep_in[CDC_RNDIS_IN_EP & 0xFU].is_used = 0U;

  /* Close EP OUT */
  (void)USBD_LL_CloseEP(pdev, CDC_RNDIS_OUT_EP);
  pdev->ep_out[CDC_RNDIS_OUT_EP & 0xFU].is_used = 0U;

  /* Close Command IN EP */
  (void)USBD_LL_CloseEP(pdev, CDC_RNDIS_CMD_EP);
  pdev->ep_in[CDC_RNDIS_CMD_EP & 0xFU].is_used = 0U;

  /* DeInit  physical Interface components */
  if (pdev->pClassData != NULL)
  {
    ((USBD_CDC_RNDIS_ItfTypeDef *)pdev->pUserData)->DeInit();
    USBD_free(pdev->pClassData);
    pdev->pClassData = NULL;
  }

  return (uint8_t)USBD_OK;
}

/**
  * @brief  USBD_CDC_RNDIS_Setup
  *         Handle the CDC specific requests
  * @param  pdev: instance
  * @param  req: usb requests
  * @retval status
  */
static uint8_t USBD_CDC_RNDIS_Setup(USBD_HandleTypeDef *pdev,
                                    USBD_SetupReqTypedef *req)
{
  USBD_CDC_RNDIS_HandleTypeDef *hcdc = (USBD_CDC_RNDIS_HandleTypeDef *)pdev->pClassData;
  USBD_CDC_RNDIS_CtrlMsgTypeDef *Msg = (USBD_CDC_RNDIS_CtrlMsgTypeDef *)(void *)hcdc->data;
  uint8_t ifalt = 0U;
  uint16_t status_info = 0U;
  USBD_StatusTypeDef ret = USBD_OK;

  if (hcdc == NULL)
  {
    return (uint8_t)USBD_FAIL;
  }

  switch (req->bmRequest & USB_REQ_TYPE_MASK)
  {
    case USB_REQ_TYPE_CLASS :
      if (req->wLength != 0U)
      {
        /* Control Request Data from Device to Host, send data prepared by device */
        if ((req->bmRequest & 0x80U) != 0U)
        {
          /* Update opcode and length */
          hcdc->CmdOpCode = req->bRequest;
          hcdc->CmdLength = (uint8_t)req->wLength;

          if (hcdc->CmdOpCode == CDC_RNDIS_GET_ENCAPSULATED_RESPONSE)
          {
            /* Data of Response Message has already been prepared by USBD_CDC_RNDIS_MsgParsing.
            Just check that length is corresponding to right expected value */
            if (req->wLength != Msg->MsgLength)
            {
            }
          }

          /* Allow application layer to pre-process data or add own processing before sending response */
          ((USBD_CDC_RNDIS_ItfTypeDef *)pdev->pUserData)->Control(req->bRequest,
                                                                  (uint8_t *)hcdc->data,
                                                                  req->wLength);
          /* Check if Response is ready */
          if (hcdc->ResponseRdy != 0U)
          {
            /* Clear Response Ready flag */
            hcdc->ResponseRdy = 0U;

            /* Send data on control endpoint */
            (void)USBD_CtlSendData(pdev, (uint8_t *)hcdc->data, Msg->MsgLength);
          }
          else
          {
            /* CDC_RNDIS Specification says: If for some reason the device receives a GET ENCAPSULATED RESPONSE
            and is unable to respond with a valid data on the Control endpoint,
            then it should return a one-byte packet set to 0x00, rather than
            stalling the Control endpoint */
            (void)USBD_CtlSendData(pdev, &EmptyResponse, 1U);
          }
        }
        /* Control Request Data from Host to Device: Prepare reception of control data stage */
        else
        {
          hcdc->CmdOpCode = req->bRequest;
          hcdc->CmdLength = (uint8_t)req->wLength;

          (void)USBD_CtlPrepareRx(pdev, (uint8_t *)hcdc->data, req->wLength);
        }
      }
      /* No Data control request: there is no such request for CDC_RNDIS protocol,
      so let application layer manage this case */
      else
      {
        ((USBD_CDC_RNDIS_ItfTypeDef *)pdev->pUserData)->Control(req->bRequest,
                                                                (uint8_t *)req, 0U);
      }
      break;

    case USB_REQ_TYPE_STANDARD:
      switch (req->bRequest)
      {
        case USB_REQ_GET_STATUS:
          if (pdev->dev_state == USBD_STATE_CONFIGURED)
          {
            (void)USBD_CtlSendData(pdev, (uint8_t *)&status_info, 2U);
          }
          else
          {
            USBD_CtlError(pdev, req);
            ret = USBD_FAIL;
          }
          break;

        case USB_REQ_GET_INTERFACE:
          if (pdev->dev_state == USBD_STATE_CONFIGURED)
          {
            (void)USBD_CtlSendData(pdev, &ifalt, 1U);
          }
          else
          {
            USBD_CtlError(pdev, req);
            ret = USBD_FAIL;
          }
          break;

        case USB_REQ_SET_INTERFACE:
          if (pdev->dev_state != USBD_STATE_CONFIGURED)
          {
            USBD_CtlError(pdev, req);
            ret = USBD_FAIL;
          }
          break;

        case USB_REQ_CLEAR_FEATURE:
          break;

        default:
          USBD_CtlError(pdev, req);
          ret = USBD_FAIL;
          break;
      }
      break;

    default:
      USBD_CtlError(pdev, req);
      ret = USBD_FAIL;
      break;
  }

  return (uint8_t)ret;
}

/**
  * @brief  USBD_CDC_RNDIS_DataIn
  *         Data sent on non-control IN endpoint
  * @param  pdev: device instance
  * @param  epnum: endpoint number
  * @retval status
 */

static uint8_t USBD_CDC_RNDIS_DataIn(USBD_HandleTypeDef *pdev, uint8_t epnum) {
	USBD_CDC_RNDIS_HandleTypeDef *hcdc;
	PCD_HandleTypeDef *hpcd = pdev->pData;

