R2fA9r/STM32/STM32F412G_Disco_CDC_RNDIS_lwIP/Middlewares/ST/STM32_USB_Device_Library/Class/CDC_RNDIS/Src/usbd_cdc_rndis.c
	if (pdev->pClassData == NULL) {
		return (uint8_t) USBD_FAIL;
	}

	hcdc = (USBD_CDC_RNDIS_HandleTypeDef *) pdev->pClassData;

	if (epnum == (CDC_RNDIS_IN_EP & 0x7FU)) {
		if ((pdev->ep_in[epnum & 0xFU].total_length > 0U) && ((pdev->ep_in[epnum & 0xFU].total_length % hpcd->IN_ep[epnum & 0xFU].maxpacket) == 0U)) {
			/* Update the packet total length */
			pdev->ep_in[epnum & 0xFU].total_length = 0U;

			/* Send ZLP */
			(void) USBD_LL_Transmit(pdev, epnum, NULL, 0U);
		} else {
			hcdc->TxState = 0U;

			if (((USBD_CDC_RNDIS_ItfTypeDef *) pdev->pUserData)->TransmitCplt != NULL) {
				((USBD_CDC_RNDIS_ItfTypeDef *) pdev->pUserData)->TransmitCplt(hcdc->TxBuffer, &hcdc->TxLength, epnum);
			}
		}
	} else if (epnum == (CDC_RNDIS_CMD_EP & 0x7FU)) {
		if (hcdc->NotificationStatus != 0U) {
			(void) USBD_CDC_RNDIS_SendNotification(pdev, CONNECTION_SPEED_CHANGE, 0U, (uint8_t *) ConnSpeedTab);

			hcdc->NotificationStatus = 0U;
		}
	} else {
		return (uint8_t) USBD_FAIL;
	}

	return (uint8_t) USBD_OK;
}

/**
  * @brief  USBD_CDC_RNDIS_DataOut
  *         Data received on non-control Out endpoint
  * @param  pdev: device instance
  * @param  epnum: endpoint number
  * @retval status
  */
static uint8_t USBD_CDC_RNDIS_DataOut(USBD_HandleTypeDef *pdev, uint8_t epnum) {
	USBD_CDC_RNDIS_HandleTypeDef *hcdc;
	uint32_t CurrPcktLen;

	if (pdev->pClassData == NULL) {
		return (uint8_t) USBD_FAIL;
	}

	hcdc = (USBD_CDC_RNDIS_HandleTypeDef *) pdev->pClassData;

	if (epnum == CDC_RNDIS_OUT_EP) {
		/* Get the received data length */
		CurrPcktLen = USBD_LL_GetRxDataSize(pdev, epnum);

		/* Increment the frame length */
		hcdc->RxLength += CurrPcktLen;

		/* If the buffer size is less than max packet size: it is the last packet in current frame */
		if ((CurrPcktLen < hcdc->MaxPcktLen) || (hcdc->RxLength >= (CDC_RNDIS_ETH_MAX_SEGSZE + sizeof(USBD_CDC_RNDIS_PacketMsgTypeDef)))) {
			/* USB data will be immediately processed, this allow next USB traffic being
			 NAKed till the end of the application Xfer */

			/* Call data packet message parsing and processing function */
			(void) USBD_CDC_RNDIS_ProcessPacketMsg(pdev, (USBD_CDC_RNDIS_PacketMsgTypeDef *) (void *) hcdc->RxBuffer);

			/* Note: Important to RESET the RxLength. That was a bug in the initial implementation by ST */
			hcdc->RxLength = 0;

		} else {
			/* Prepare Out endpoint to receive next packet in current/new frame */
			(void) USBD_LL_PrepareReceive(pdev, CDC_RNDIS_OUT_EP, (uint8_t *) (hcdc->RxBuffer + hcdc->RxLength), hcdc->MaxPcktLen);
		}
	} else {
		return (uint8_t) USBD_FAIL;
	}


	return (uint8_t) USBD_OK;
}

/**
  * @brief  USBD_CDC_RNDIS_EP0_RxReady
  *         Handle EP0 Rx Ready event
  * @param  pdev: device instance
  * @retval status
  */
static uint8_t USBD_CDC_RNDIS_EP0_RxReady(USBD_HandleTypeDef *pdev)
{
  USBD_CDC_RNDIS_HandleTypeDef *hcdc = (USBD_CDC_RNDIS_HandleTypeDef *)pdev->pClassData;

  if (hcdc == NULL)
  {
    return (uint8_t)USBD_FAIL;
  }

  if ((pdev->pUserData != NULL) && (hcdc->CmdOpCode != 0xFFU))
  {
    /* Check if the received command is SendEncapsulated command */
    if (hcdc->CmdOpCode == CDC_RNDIS_SEND_ENCAPSULATED_COMMAND)
    {
      /* Process Received CDC_RNDIS Control Message */
      (void)USBD_CDC_RNDIS_MsgParsing(pdev, (uint8_t *)(hcdc->data));

      /* Reset the command opcode for next processing */
      hcdc->CmdOpCode = 0xFFU;
    }
    else
    {
      /* Reset the command opcode for next processing */
      hcdc->CmdOpCode = 0xFFU;

      /* Ignore the command and return fail */
      return (uint8_t)USBD_FAIL;
    }
  } else {
	  return (uint8_t)USBD_FAIL;
  }

  return (uint8_t)USBD_OK;
}

/**
  * @brief  USBD_CDC_RNDIS_GetFSCfgDesc
  *         Return configuration descriptor
  * @param  speed : current device speed
  * @param  length : pointer data length
  * @retval pointer to descriptor buffer
  */
static uint8_t *USBD_CDC_RNDIS_GetFSCfgDesc(uint16_t *length)
{
  *length = (uint16_t)(sizeof(USBDeviceConfigurationDescriptor_t));

  return (uint8_t*)&USBD_CDC_RNDIS_CfgFSDesc;
}

/**
  * @brief  USBD_CDC_RNDIS_GetHSCfgDesc
  *         Return configuration descriptor
  * @param  speed : current device speed
  * @param  length : pointer data length
  * @retval pointer to descriptor buffer
  */
static uint8_t *USBD_CDC_RNDIS_GetHSCfgDesc(uint16_t *length)
{
  *length = (uint16_t)(sizeof(USBDeviceConfigurationDescriptor_t));

  return (uint8_t*)&USBD_CDC_RNDIS_CfgFSDesc;
}

/**
  * @brief  USBD_CDC_RNDIS_GetOtherSpeedCfgDesc
  *         Return configuration descriptor
  * @param  speed : current device speed
  * @param  length : pointer data length
  * @retval pointer to descriptor buffer
  */
static uint8_t *USBD_CDC_RNDIS_GetOtherSpeedCfgDesc(uint16_t *length)
{
  *length = (uint16_t)(sizeof(USBDeviceConfigurationDescriptor_t));

  return (uint8_t*)&USBD_CDC_RNDIS_CfgFSDesc;
}

/**
  * @brief  DeviceQualifierDescriptor
  *         return Device Qualifier descriptor
  * @param  length : pointer data length
  * @retval pointer to descriptor buffer
  */
uint8_t *USBD_CDC_RNDIS_GetDeviceQualifierDescriptor(uint16_t *length)
{
  *length = (uint16_t)(sizeof(USBDeviceQualifierDescriptor_t));

  return (uint8_t*)&USBD_CDC_RNDIS_DeviceQualifierDesc;
}

/**
  * @brief  USBD_CDC_RNDIS_RegisterInterface
  * @param  pdev: device instance
  * @param  fops: CD  Interface callback
  * @retval status
  */
uint8_t USBD_CDC_RNDIS_RegisterInterface(USBD_HandleTypeDef *pdev,
                                         USBD_CDC_RNDIS_ItfTypeDef *fops)
{
  if (fops == NULL)
  {
    return (uint8_t)USBD_FAIL;
  }

  pdev->pUserData = fops;

  return (uint8_t)USBD_OK;
}


/**
  * @brief  USBD_CDC_RNDIS_USRStringDescriptor
  *         Manages the transfer of user string descriptors.
  * @param  speed : current device speed
  * @param  index: descriptor index
  * @param  length : pointer data length
  * @retval pointer to the descriptor table or NULL if the descriptor is not supported.
  */
#if (USBD_SUPPORT_USER_STRING_DESC == 1U)
static uint8_t *USBD_CDC_RNDIS_USRStringDescriptor(USBD_HandleTypeDef *pdev, uint8_t index, uint16_t *length)
{
  static uint8_t USBD_StrDesc[255];

  /* Check if the requested string interface is supported */
  if (index == CDC_RNDIS_MAC_STRING_INDEX)
  {
    USBD_GetString((uint8_t *)((USBD_CDC_RNDIS_ItfTypeDef *)pdev->pUserData)->pStrDesc, USBD_StrDesc, length);
    return USBD_StrDesc;
  }
  /* Not supported Interface Descriptor index */
  else
  {
    return NULL;
  }
}
#endif /* USBD_SUPPORT_USER_STRING_DESC */

/**
  * @brief  USBD_CDC_RNDIS_SetTxBuffer
  * @param  pdev: device instance
  * @param  pbuff: Tx Buffer
  * @retval status
  */
uint8_t USBD_CDC_RNDIS_SetTxBuffer(USBD_HandleTypeDef *pdev, uint8_t *pbuff, uint32_t length)
{
  USBD_CDC_RNDIS_HandleTypeDef *hcdc = (USBD_CDC_RNDIS_HandleTypeDef *)pdev->pClassData;

  if (hcdc == NULL)
  {
    return (uint8_t)USBD_FAIL;
  }

  hcdc->TxBuffer = pbuff;
  hcdc->TxLength = length;

  return (uint8_t)USBD_OK;
}


/**
  * @brief  USBD_CDC_RNDIS_SetRxBuffer
  * @param  pdev: device instance
  * @param  pbuff: Rx Buffer
  * @retval status
  */
uint8_t USBD_CDC_RNDIS_SetRxBuffer(USBD_HandleTypeDef *pdev, uint8_t *pbuff)
{
  USBD_CDC_RNDIS_HandleTypeDef *hcdc = (USBD_CDC_RNDIS_HandleTypeDef *)pdev->pClassData;

  if (hcdc == NULL)
  {
    return (uint8_t)USBD_FAIL;
  }

  hcdc->RxBuffer = pbuff;

  return (uint8_t)USBD_OK;
}


/**
  * @brief  USBD_CDC_RNDIS_TransmitPacket
  *         Transmit packet on IN endpoint
  * @param  pdev: device instance
  * @retval status
 */
uint8_t USBD_CDC_RNDIS_TransmitPacket(USBD_HandleTypeDef *pdev) {

	BSP_LED_Toggle(LED_RED);
	USBD_CDC_RNDIS_HandleTypeDef *hcdc;
	USBD_CDC_RNDIS_PacketMsgTypeDef *PacketMsg;
	USBD_StatusTypeDef ret = USBD_BUSY;

