R2fA9r/STM32/STM32F412G_Disco_CDC_RNDIS_lwIP/Middlewares/ST/STM32_USB_Device_Library/Class/CDC_RNDIS/Src/usbd_cdc_rndis.c
  /* Set CDC_RNDIS state to INITIALIZED */
  hcdc->State = CDC_RNDIS_STATE_INITIALIZED;

  /* Set Response Ready field in order to send response during next control request */
  hcdc->ResponseRdy = 1U;

  /* Send Notification on Interrupt EP to inform Host that response is ready */
  (void)USBD_CDC_RNDIS_SendNotification(pdev, RESPONSE_AVAILABLE, 0U, NULL);

  return (uint8_t)USBD_OK;
}


/**
  * @brief  USBD_CDC_RNDIS_ProcessHaltMsg
  *         Parse, extract data and check correctness of CDC_RNDIS Halt command.
  * @param  pdev: USB Device Handle pointer
  * @param  Msg: Pointer to the message data extracted from SendEncapsulated command
  * @retval status
  */
static uint8_t USBD_CDC_RNDIS_ProcessHaltMsg(USBD_HandleTypeDef *pdev,
                                             USBD_CDC_RNDIS_HaltMsgTypeDef *Msg)
{
  /* Get the CDC_RNDIS handle pointer */
  USBD_CDC_RNDIS_HandleTypeDef *hcdc = (USBD_CDC_RNDIS_HandleTypeDef *)pdev->pClassData;

  if (hcdc == NULL)
  {
    return (uint8_t)USBD_FAIL;
  }

  /* Set CDC_RNDIS state to INITIALIZED */
  hcdc->State = CDC_RNDIS_STATE_UNINITIALIZED;

  /* No response required for this message, so no notification (RESPONSE_AVAILABLE) is sent */

  UNUSED(Msg);

  return (uint8_t)USBD_OK;
}


/**
  * @brief  USBD_CDC_RNDIS_ProcessKeepAliveMsg
  *         Parse, extract data and check correctness of CDC_RNDIS KeepAlive command.
  * @param  pdev: USB Device Handle pointer
  * @param  Msg: Pointer to the message data extracted from SendEncapsulated command
  * @retval status
  */
static uint8_t USBD_CDC_RNDIS_ProcessKeepAliveMsg(USBD_HandleTypeDef *pdev,
                                                  USBD_CDC_RNDIS_KpAliveMsgTypeDef *Msg)
{
  /* Get the CDC_RNDIS handle pointer */
  USBD_CDC_RNDIS_HandleTypeDef *hcdc = (USBD_CDC_RNDIS_HandleTypeDef *)pdev->pClassData;

  /* Use same Msg input buffer as response buffer */
  USBD_CDC_RNDIS_KpAliveCpltMsgTypeDef *InitResponse = (USBD_CDC_RNDIS_KpAliveCpltMsgTypeDef *)(void *)Msg;

  /* Store the Message Request ID */
  uint32_t ReqId = Msg->ReqId;

  if (hcdc == NULL)
  {
    return (uint8_t)USBD_FAIL;
  }

  /* Check correctness of the message (MsgType already checked by entry to this function) */
  if (Msg->MsgLength != sizeof(USBD_CDC_RNDIS_KpAliveMsgTypeDef))
  {
    InitResponse->Status = CDC_RNDIS_STATUS_FAILURE;
  }
  else
  {
    InitResponse->Status = CDC_RNDIS_STATUS_SUCCESS;
  }

  /* Setup the response buffer content */
  InitResponse->MsgType = CDC_RNDIS_KEEPALIVE_CMPLT_ID;
  InitResponse->MsgLength = sizeof(USBD_CDC_RNDIS_KpAliveCpltMsgTypeDef);
  InitResponse->ReqId = ReqId;
  InitResponse->Status = CDC_RNDIS_STATUS_SUCCESS;

  /* Set Response Ready field in order to send response during next control request */
  hcdc->ResponseRdy = 1U;

  /* Send Notification on Interrupt EP to inform Host that response is ready */
  (void)USBD_CDC_RNDIS_SendNotification(pdev, RESPONSE_AVAILABLE, 0U, NULL);

  return (uint8_t)USBD_OK;
}


/**
  * @brief  USBD_CDC_RNDIS_ProcessQueryMsg
  *         Parse, extract data and check correctness of CDC_RNDIS Query command.
  * @param  pdev: USB Device Handle pointer
  * @param  Msg: Pointer to the message data extracted from SendEncapsulated command
  * @retval status
  */
static uint8_t USBD_CDC_RNDIS_ProcessQueryMsg(USBD_HandleTypeDef *pdev,
                                              USBD_CDC_RNDIS_QueryMsgTypeDef *Msg)
{
  /* Get the CDC_RNDIS handle pointer */
  USBD_CDC_RNDIS_HandleTypeDef *hcdc = (USBD_CDC_RNDIS_HandleTypeDef *)pdev->pClassData;

  /* Use same Msg input buffer as response buffer */
  USBD_CDC_RNDIS_QueryCpltMsgTypeDef *QueryResponse = (USBD_CDC_RNDIS_QueryCpltMsgTypeDef *)(void *)Msg;

  /* Store the Message Request ID */
  uint32_t ReqId = Msg->RequestId;

  if (hcdc == NULL)
  {
    return (uint8_t)USBD_FAIL;
  }

  /* Process the OID depending on its code */
  switch (Msg->Oid)
  {
    case OID_GEN_SUPPORTED_LIST:
      QueryResponse->InfoBufLength = sizeof(CDC_RNDIS_SupportedOIDs);
      (void)USBD_memcpy(QueryResponse->InfoBuf, CDC_RNDIS_SupportedOIDs,
                        sizeof(CDC_RNDIS_SupportedOIDs));

      QueryResponse->Status = CDC_RNDIS_STATUS_SUCCESS;
      break;

    case OID_GEN_HARDWARE_STATUS:
      QueryResponse->InfoBufLength = sizeof(uint32_t);
      QueryResponse->InfoBuf[0] = CDC_RNDIS_HW_STS_READY;
      QueryResponse->Status = CDC_RNDIS_STATUS_SUCCESS;
      break;

    case OID_GEN_MEDIA_SUPPORTED:
    case OID_GEN_MEDIA_IN_USE:
      QueryResponse->InfoBufLength = sizeof(uint32_t);
      QueryResponse->InfoBuf[0] = CDC_RNDIS_MEDIUM_802_3;
      QueryResponse->Status = CDC_RNDIS_STATUS_SUCCESS;
      break;

    case OID_GEN_VENDOR_ID:
      QueryResponse->InfoBufLength = sizeof(uint32_t);
      QueryResponse->InfoBuf[0] = USBD_CDC_RNDIS_VID;
      QueryResponse->Status = CDC_RNDIS_STATUS_SUCCESS;
      break;

    case OID_GEN_MAXIMUM_FRAME_SIZE:
    case OID_GEN_TRANSMIT_BLOCK_SIZE:
    case OID_GEN_RECEIVE_BLOCK_SIZE:
      QueryResponse->InfoBufLength = sizeof(uint32_t);
      QueryResponse->InfoBuf[0] = CDC_RNDIS_ETH_FRAME_SIZE_MAX;
      QueryResponse->Status = CDC_RNDIS_STATUS_SUCCESS;
      break;

    case OID_GEN_VENDOR_DESCRIPTION:
      QueryResponse->InfoBufLength = (strlen(USBD_CDC_RNDIS_VENDOR_DESC) + 1U);
      (void)USBD_memcpy(QueryResponse->InfoBuf, USBD_CDC_RNDIS_VENDOR_DESC,
                        strlen(USBD_CDC_RNDIS_VENDOR_DESC));

      QueryResponse->Status = CDC_RNDIS_STATUS_SUCCESS;
      break;

    case OID_GEN_MEDIA_CONNECT_STATUS:
      QueryResponse->InfoBufLength = sizeof(uint32_t);
      QueryResponse->InfoBuf[0] = CDC_RNDIS_MEDIA_STATE_CONNECTED;
      QueryResponse->Status = CDC_RNDIS_STATUS_SUCCESS;
      break;

    case OID_GEN_MAXIMUM_SEND_PACKETS:
      QueryResponse->InfoBufLength = sizeof(uint32_t);
      QueryResponse->InfoBuf[0] = 1U;
      QueryResponse->Status = CDC_RNDIS_STATUS_SUCCESS;
      break;

    case OID_GEN_LINK_SPEED:
      QueryResponse->InfoBufLength = sizeof(uint32_t);
      QueryResponse->InfoBuf[0] = USBD_CDC_RNDIS_LINK_SPEED;
      QueryResponse->Status = CDC_RNDIS_STATUS_SUCCESS;
      break;

